In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [5]:
inputes = df.drop('Survived',axis=1)
inputes

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [6]:
inputes_encoded = pd.get_dummies(df['Sex'])

In [7]:
inputes_encoded=inputes_encoded.astype('int')

In [8]:
inputes_encoded

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [9]:
new_inputes = pd.concat([inputes,inputes_encoded],axis=1)
new_inputes

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [10]:
new_inputes.drop(['Sex'],axis=1,inplace=True)
new_inputes.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [11]:
new_inputes.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [12]:
new_inputes['Age']=new_inputes['Age'].fillna(new_inputes['Age'].median())

In [13]:
new_inputes.isnull().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [14]:
# now using the train_test_split method 
from sklearn.model_selection import train_test_split

In [15]:
X_train,X_test,y_train,y_test=train_test_split(new_inputes,target,test_size=0.2,random_state=42)

In [16]:
len(X_train)

712

In [17]:
len(X_test)

179

In [18]:
len(new_inputes)

891

In [19]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [20]:
model.fit(X_train,y_train)

GaussianNB()

In [21]:
model.score(X_test,y_test)

0.776536312849162

In [22]:
X_test[:10]

     Pclass   Age     Fare  female  male
709       3  28.0  15.2458       0     1
439       2  31.0  10.5000       0     1
840       3  20.0   7.9250       0     1
720       2   6.0  33.0000       1     0
39        3  14.0  11.2417       1     0
290       1  26.0  78.8500       1     0
300       3  28.0   7.7500       1     0
333       3  16.0  18.0000       0     1
208       3  16.0   7.7500       1     0
136       1  19.0  26.2833       1     0

In [23]:
y_test[:10]

709    1
439    0
840    0
720    1
39     1
290    1
300    1
333    0
208    1
136    1
Name: Survived, dtype: int64

In [24]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1], dtype=int64)

In [25]:
model.predict_proba(X_test[:10])

array([[0.99053491, 0.00946509],
       [0.9799929 , 0.0200071 ],
       [0.98901607, 0.01098393],
       [0.01464464, 0.98535536],
       [0.04658294, 0.95341706],
       [0.0018719 , 0.9981281 ],
       [0.06056141, 0.93943859],
       [0.98807337, 0.01192663],
       [0.04864963, 0.95135037],
       [0.00710814, 0.99289186]])